[
    {
        "image": "single_family_home.jpg",
        "estate_title": "Stunning Single Family Home with Mountain Views",
        "id": "RES001",
        "segment_name": "Single-family home",
        "description": "Escape to this exquisite single-family home nestled amidst the serene beauty of the mountains. This spacious residence offers the perfect blend of luxury and comfort, with expansive living areas, high-end finishes, and breathtaking views from every window. The main level features a grand foyer, formal living and dining rooms, a gourmet kitchen with top-of-the-line appliances, and a cozy family room with a fireplace. Upstairs, the luxurious master suite boasts a spa-like ensuite bathroom and a private balcony overlooking the majestic mountains. Additional amenities include a home office, a wine cellar, and a sprawling backyard with a patio and lush landscaping. Whether you're hosting elegant soirées or enjoying quiet moments of relaxation, this single-family home offers the ultimate in mountain living.",
        "price": "$1,800,000",
        "status": "sale",
        "area": "4500 sq ft",
        "location": "Aspen, Colorado",
        "facilities": ["mountain views", "gourmet kitchen", "home office"]
      },
      {
        "image": "townhouse.jpg",
        "estate_title": "Modern Townhouse in Vibrant Urban Neighborhood",
        "id": "RES002",
        "segment_name": "Townhouse",
        "description": "Live in style in this modern townhouse located in a vibrant urban neighborhood. Designed for contemporary living, this sleek residence features clean lines, high ceilings, and an abundance of natural light. The main level boasts an open-concept layout with a gourmet kitchen, spacious living area, and dining space - perfect for entertaining guests. Upstairs, you'll find the luxurious master suite with a walk-in closet and ensuite bathroom, as well as two additional bedrooms and a full bathroom. The rooftop terrace offers stunning city views and is ideal for al fresco dining or enjoying a morning coffee. With its prime location and chic design, this townhouse offers the ultimate urban lifestyle experience.",
        "price": "$900,000",
        "status": "sale",
        "area": "2000 sq ft",
        "location": "Brooklyn, New York",
        "facilities": ["rooftop terrace", "modern design", "city views"]
      },
      {
        "image": "apartment.jpg",
        "estate_title": "Luxurious Apartment with Riverfront Views",
        "id": "RES003",
        "segment_name": "Apartment",
        "description": "Experience luxury living at its finest in this exquisite apartment overlooking the scenic riverfront. Located in a prestigious waterfront building, this residence offers unparalleled amenities and breathtaking views of the river and city skyline. The interior features high-end finishes, hardwood floors, and floor-to-ceiling windows that flood the space with natural light. The gourmet kitchen is equipped with top-of-the-line appliances and a breakfast bar, perfect for casual dining. The spacious master suite boasts a walk-in closet and a spa-like ensuite bathroom with a soaking tub and separate shower. Residents enjoy access to a fitness center, concierge service, and a landscaped courtyard. With its prime location and resort-style amenities, this apartment offers the ultimate in waterfront living.",
        "price": "$1,200,000",
        "status": "sale",
        "area": "1800 sq ft",
        "location": "Chicago, Illinois",
        "facilities": ["riverfront views", "gourmet kitchen", "fitness center"]
      },
      {
        "image": "student_housing.jpg",
        "estate_title": "Modern Student Housing Near University Campus",
        "id": "RES004",
        "segment_name": "Student housing",
        "description": "Live in comfort and style in this modern student housing complex located just steps away from the university campus. Designed with students in mind, this residence offers a range of amenities and convenient features to support academic success and a vibrant campus lifestyle. The fully furnished apartments feature spacious bedrooms, private bathrooms, and shared living areas, providing the perfect balance of privacy and community. Residents enjoy access to on-site study lounges, a fitness center, and recreational facilities including a pool and basketball court. With its prime location and student-friendly amenities, this housing complex offers the ultimate in convenience and comfort for university students.",
        "price": "$700 per month",
        "status": "rent",
        "area": "800 sq ft",
        "location": "Los Angeles, California",
        "facilities": ["fully furnished", "on-site study lounges", "fitness center"]
      },
      {
        "image": "senior_living_community.jpg",
        "estate_title": "Upscale Senior Living Community with Resort Amenities",
        "id": "RES005",
        "segment_name": "Senior living community",
        "description": "Enjoy retirement in style at this upscale senior living community offering resort-style amenities and personalized care services. Situated on beautifully landscaped grounds, this community provides a tranquil setting for seniors to enjoy their golden years. Residents can choose from a variety of accommodation options, including spacious apartments and cozy cottages, each designed for comfort and convenience. Amenities include multiple dining venues, a fitness center, a heated indoor pool, and a full-service spa. A dedicated staff provides 24-hour assistance and personalized care plans to meet the individual needs of each resident. With its luxurious amenities and vibrant social atmosphere, this senior living community offers the perfect blend of relaxation and excitement for retirees.",
        "price": "$5,000 per month",
        "status": "rent",
        "area": "1200 sq ft",
        "location": "Scottsdale, Arizona",
        "facilities": ["resort amenities", "personalized care services", "24-hour assistance"]
      },
      {
        "image": "vacation_rental.jpg",
        "estate_title": "Seaside Vacation Rental with Private Beach Access",
        "id": "RES006",
        "segment_name": "Vacation rental",
        "description": "Escape to paradise with this stunning seaside vacation rental offering exclusive access to a pristine beach. Located in a secluded coastal enclave, this residence is the perfect retreat for families and friends seeking relaxation and adventure. The interior features coastal-inspired decor, spacious living areas, and panoramic ocean views from every room. The fully equipped kitchen and outdoor BBQ area make it easy to prepare meals and entertain guests. Outside, the expansive deck is ideal for soaking up the sun or enjoying al fresco dining with breathtaking views of the ocean. Guests also have access to beach chairs, umbrellas, and water sports equipment for added convenience. Whether you're lounging on the beach or exploring nearby attractions, this vacation rental offers the ultimate beachside getaway.",
        "price": "$400 per night",
        "status": "rent",
        "area": "2500 sq ft",
        "location": "Maui, Hawaii",
        "facilities": ["private beach access", "ocean views", "outdoor BBQ area"]
      },
      {
        "image": "townhouse_2.jpg",
        "estate_title": "Elegant Townhouse in Historic District",
        "id": "RES007",
        "segment_name": "Townhouse",
        "description": "Discover timeless elegance in this meticulously restored townhouse located in a historic district. This exquisite residence seamlessly blends historic charm with modern amenities, offering the perfect blend of old-world sophistication and contemporary comfort. The interior features original architectural details, including ornate moldings, hardwood floors, and soaring ceilings. The spacious layout includes multiple living areas, a formal dining room, and a gourmet kitchen with high-end appliances. Upstairs, the master suite offers a luxurious retreat with a spa-like ensuite bathroom and a private balcony overlooking the courtyard. With its prime location and unparalleled craftsmanship, this townhouse offers a truly exceptional living experience.",
        "price": "$2,200,000",
        "status": "sale",
        "area": "3200 sq ft",
        "location": "Charleston, South Carolina",
        "facilities": ["historic charm", "gourmet kitchen", "private balcony"]
      },
      {
        "image": "apartment_2.jpg",
        "estate_title": "Luxury Apartment in Skyline Tower",
        "id": "RES008",
        "segment_name": "Apartment",
        "description": "Experience urban luxury at its finest in this sleek apartment located in the prestigious Skyline Tower. Perched high above the city, this residence offers breathtaking panoramic views of the skyline and beyond. The interior features designer finishes, floor-to-ceiling windows, and an open-concept layout that maximizes natural light and space. The gourmet kitchen is equipped with top-of-the-line appliances, custom cabinetry, and quartz countertops. The spacious master suite boasts a spa-inspired ensuite bathroom and a walk-in closet. Residents enjoy access to exclusive amenities, including a rooftop pool, fitness center, and resident lounge. With its prime location and resort-style amenities, this apartment offers the ultimate urban lifestyle experience.",
        "price": "$1,500,000",
        "status": "sale",
        "area": "1800 sq ft",
        "location": "Seattle, Washington",
        "facilities": ["panoramic views", "gourmet kitchen", "rooftop pool"]
      },
      {
        "image": "student_housing_2.jpg",
        "estate_title": "Modern Student Housing Near Campus",
        "id": "RES019",
        "segment_name": "Student housing",
        "description": "Live in comfort and convenience in this modern student housing complex located just minutes away from campus. Designed with student life in mind, this residence offers a range of amenities and services to support academic success and a vibrant campus community. The fully furnished apartments feature contemporary decor, private bedrooms, and shared living spaces, providing the perfect balance of privacy and socialization. Residents have access to on-site study lounges, a fitness center, and recreational facilities including a game room and outdoor courtyard. With its central location and student-friendly amenities, this housing complex offers the ultimate college living experience.",
        "price": "$800 per month",
        "status": "rent",
        "area": "900 sq ft",
        "location": "Austin, Texas",
        "facilities": ["fully furnished", "study lounges", "fitness center"]
      }
]